In [2]:
data=readcsv("goods_ prices.cvs")

NameError: name 'readcsv' is not defined

In [5]:
pip install pandas

Collecting pandas
  Downloading pandas-1.4.2-cp310-cp310-win_amd64.whl (10.6 MB)
Requirement already satisfied: pytz>=2020.1 in c:\users\nithesh\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\nithesh\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Collecting numpy>=1.21.0
  Downloading numpy-1.22.3-cp310-cp310-win_amd64.whl (14.7 MB)
Requirement already satisfied: six>=1.5 in c:\users\nithesh\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: numpy, pandas
Successfully installed numpy-1.22.3 pandas-1.4.2
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.3.1; however, version 22.1 is available.
You should consider upgrading via the 'C:\Users\Nithesh\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
data_csv=pd.read_csv('hiring.csv')
data_csv

              goods  prices
0       Fitbit Plus    7980
1             Ipods   22349
2           MI Band     999
3         Cult Pass    2799
4       Macbook Pro  229900
5    Digital Camera   11101
6             Alexa    9999
7  Sandwich Toaster    2195
8    Microwave Oven    9800
9             Scale    4999

In [10]:
n=int(input("enter employee number"))

enter employee number5

In [11]:
print(n)

5

In [20]:
a=data_csv.head(3)
a

         goods  prices
0  Fitbit Plus    7980
1        Ipods   22349
2      MI Band     999

In [24]:
b=max(a['prices'])
b

22349

In [26]:
c=min(a['prices'])
c

999

In [27]:
dif=b-c
dif

21350

In [31]:
import pandas as pd
data_csv=pd.read_csv('hiring.csv')
data_csv

              goods  prices
0       Fitbit Plus    7980
1             Ipods   22349
2           MI Band     999
3         Cult Pass    2799
4       Macbook Pro  229900
5    Digital Camera   11101
6             Alexa    9999
7  Sandwich Toaster    2195
8    Microwave Oven    9800
9             Scale    4999

In [32]:
n=int(input("enter number of employee"))
a=data_csv.head(n)
b=max(a['prices'])
c=min(a['prices'])
dif=b-c
print(a)
print('And the difference between the chosen goodie with highest price and the lowest price is  ',dif)

enter number of employee4
         goods  prices
0  Fitbit Plus    7980
1        Ipods   22349
2      MI Band     999
3    Cult Pass    2799
And the difference between the chosen goodie with highest price and the lowest price is   21350